Revit 2024 API
BuiltInFailures.LoadFailures.CannotMoveHostedLoad Property
 Can't move Load based on the Host Element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotMoveHostedLoad { get; }
Visual Basic
Public Shared ReadOnly Property CannotMoveHostedLoad As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotMoveHostedLoad {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.LoadFailures Class
Autodesk.Revit.DB Namespace